Workspace/OpenFOAM-v1812-AD/tutorials/combustion/fireFoam/LES/smallPoolFire3D/constant/pyrolysisZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pyrolysis
{
    active          false;

    pyrolysisModel  none;

    region          panelRegion;

    reactingOneDimCoeffs
    {
        radFluxName     qr;

        minimumDelta    1e-8;

        moveMesh        false;
    }

    infoOutput      false;
}


// ************************************************************************* //
